logs/fio/scsi/4K2_s1_c32_q4_0_v1_f20_C20.log
precondition: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
rand-read-4K-qd1: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-write-4K-qd1: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
rand-read-4K-qd16: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-write-4K-qd16: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-rw-4K-qd16: (g=5): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
...
rand-read-4K-qd128: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-write-4K-qd128: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
rand-rw-4K-qd128: (g=8): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 123 processes

precondition: (groupid=0, jobs=1): err= 0: pid=1591: Sun Jul 21 16:01:28 2019
  write: IOPS=19.5k, BW=2440MiB/s (2559MB/s)(35.7GiB/15001msec)
    slat (usec): min=5, max=782, avg= 7.71, stdev= 3.57
    clat (usec): min=186, max=1872, avg=809.10, stdev=41.21
     lat (usec): min=194, max=1880, avg=817.44, stdev=41.14
    clat percentiles (usec):
     | 10.000th=[  791], 20.000th=[  791], 30.000th=[  791], 40.000th=[  799],
     | 50.000th=[  799], 70.000th=[  807], 90.000th=[  832], 99.000th=[  930],
     | 99.900th=[ 1303], 99.990th=[ 1762], 99.999th=[ 1827]
   bw (  MiB/s): min= 1849, max= 2394, per=79.26%, avg=1933.92, stdev=92.36, samples=29
   iops        : min=14797, max=19156, avg=15470.79, stdev=738.76, samples=29
  lat (usec)   : 250=0.05%, 500=0.07%, 750=0.08%, 1000=99.52%
  lat (msec)   : 2=0.28%
  cpu          : usr=13.18%, sys=18.76%, ctx=292204, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,292824,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
rand-read-4K-qd1: (groupid=1, jobs=1): err= 0: pid=1598: Sun Jul 21 16:01:28 2019
   read: IOPS=48.1k, BW=188MiB/s (197MB/s)(5634MiB/30001msec)
    slat (usec): min=2, max=756, avg= 3.84, stdev= 2.47
    clat (nsec): min=1197, max=829728, avg=14205.89, stdev=3921.18
     lat (usec): min=14, max=834, avg=18.65, stdev= 4.80
    clat percentiles (usec):
     | 10.000th=[   14], 20.000th=[   14], 30.000th=[   14], 40.000th=[   14],
     | 50.000th=[   14], 70.000th=[   15], 90.000th=[   15], 99.000th=[   20],
     | 99.900th=[   41], 99.990th=[   47], 99.999th=[  750]
   bw (  KiB/s): min=145025, max=181651, per=91.87%, avg=176661.15, stdev=7165.64, samples=59
   iops        : min=36256, max=45412, avg=44164.88, stdev=1791.43, samples=59
  lat (usec)   : 2=0.02%, 4=0.01%, 10=0.04%, 20=99.02%, 50=0.91%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=21.64%, sys=36.11%, ctx=1441430, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1442276,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-4K-qd1: (groupid=2, jobs=1): err= 0: pid=1599: Sun Jul 21 16:01:28 2019
  write: IOPS=44.9k, BW=176MiB/s (184MB/s)(5267MiB/30001msec)
    slat (usec): min=2, max=766, avg= 3.83, stdev= 2.11
    clat (nsec): min=1316, max=798635, avg=15689.25, stdev=4575.26
     lat (usec): min=16, max=804, avg=20.11, stdev= 5.10
    clat percentiles (usec):
     | 10.000th=[   15], 20.000th=[   16], 30.000th=[   16], 40.000th=[   16],
     | 50.000th=[   16], 70.000th=[   16], 90.000th=[   17], 99.000th=[   22],
     | 99.900th=[   42], 99.990th=[   49], 99.999th=[  758]
   bw (  KiB/s): min=143192, max=169152, per=91.81%, avg=165049.15, stdev=4454.16, samples=59
   iops        : min=35798, max=42288, avg=41261.98, stdev=1113.58, samples=59
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=98.88%, 50=1.11%
  lat (usec)   : 100=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=20.64%, sys=33.54%, ctx=1348280, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,1348316,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-read-4K-qd16: (groupid=3, jobs=20): err= 0: pid=1603: Sun Jul 21 16:01:28 2019
   read: IOPS=539k, BW=2106MiB/s (2209MB/s)(61.7GiB/30002msec)
    slat (usec): min=2, max=7747, avg=15.94, stdev=30.39
    clat (usec): min=9, max=7815, avg=128.21, stdev=65.85
     lat (usec): min=20, max=7831, avg=145.01, stdev=70.18
    clat percentiles (usec):
     | 10.000th=[   84], 20.000th=[  102], 30.000th=[  110], 40.000th=[  115],
     | 50.000th=[  119], 70.000th=[  128], 90.000th=[  157], 99.000th=[  445],
     | 99.900th=[  701], 99.990th=[  971], 99.999th=[ 1369]
   bw (  KiB/s): min=39744, max=146556, per=4.32%, avg=93255.83, stdev=16015.25, samples=1182
   iops        : min= 9936, max=36639, avg=23313.59, stdev=4003.81, samples=1182
  lat (usec)   : 10=0.01%, 20=0.01%, 50=1.51%, 100=16.75%, 250=77.48%
  lat (usec)   : 500=3.65%, 750=0.55%, 1000=0.06%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=15.01%, sys=51.12%, ctx=9236718, majf=0, minf=279
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=16177410,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write-4K-qd16: (groupid=4, jobs=20): err= 0: pid=1623: Sun Jul 21 16:01:28 2019
  write: IOPS=522k, BW=2038MiB/s (2137MB/s)(59.7GiB/30001msec)
    slat (usec): min=2, max=5560, avg=21.89, stdev=43.91
    clat (usec): min=4, max=22921, avg=126.64, stdev=93.84
     lat (usec): min=16, max=22929, avg=149.46, stdev=101.18
    clat percentiles (usec):
     | 10.000th=[   64], 20.000th=[   79], 30.000th=[   89], 40.000th=[   97],
     | 50.000th=[  103], 70.000th=[  120], 90.000th=[  212], 99.000th=[  523],
     | 99.900th=[  857], 99.990th=[ 1418], 99.999th=[ 2024]
   bw (  KiB/s): min=43674, max=121489, per=4.09%, avg=85301.11, stdev=10026.95, samples=1180
   iops        : min=10918, max=30372, avg=21324.91, stdev=2506.74, samples=1180
  lat (usec)   : 10=0.01%, 20=0.01%, 50=3.46%, 100=41.63%, 250=47.09%
  lat (usec)   : 500=6.64%, 750=1.00%, 1000=0.14%
  lat (msec)   : 2=0.05%, 4=0.01%, 10=0.01%, 50=0.01%
  cpu          : usr=15.08%, sys=61.66%, ctx=6481561, majf=0, minf=205
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,15654990,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-rw-4K-qd16: (groupid=5, jobs=20): err= 0: pid=1660: Sun Jul 21 16:01:28 2019
   read: IOPS=358k, BW=1397MiB/s (1465MB/s)(40.9GiB/30001msec)
    slat (usec): min=2, max=8643, avg=11.42, stdev=21.08
    clat (usec): min=16, max=14285, avg=141.06, stdev=49.66
     lat (usec): min=25, max=14293, avg=153.30, stdev=52.37
    clat percentiles (usec):
     | 10.000th=[  120], 20.000th=[  128], 30.000th=[  131], 40.000th=[  135],
     | 50.000th=[  137], 70.000th=[  143], 90.000th=[  157], 99.000th=[  355],
     | 99.900th=[  644], 99.990th=[  922], 99.999th=[ 3589]
   bw (  KiB/s): min=36360, max=82387, per=3.71%, avg=53124.64, stdev=5706.09, samples=1180
   iops        : min= 9090, max=20596, avg=13280.79, stdev=1426.52, samples=1180
  write: IOPS=153k, BW=599MiB/s (628MB/s)(17.5GiB/30001msec)
    slat (usec): min=2, max=7781, avg=11.65, stdev=20.53
    clat (usec): min=14, max=14272, avg=140.94, stdev=49.34
     lat (usec): min=20, max=14281, avg=153.41, stdev=51.64
    clat percentiles (usec):
     | 10.000th=[  120], 20.000th=[  128], 30.000th=[  133], 40.000th=[  135],
     | 50.000th=[  137], 70.000th=[  143], 90.000th=[  157], 99.000th=[  351],
     | 99.900th=[  635], 99.990th=[  922], 99.999th=[ 3458]
   bw (  KiB/s): min=15650, max=35277, per=3.71%, avg=22768.17, stdev=2457.59, samples=1180
   iops        : min= 3912, max= 8819, avg=5691.66, stdev=614.39, samples=1180
  lat (usec)   : 20=0.01%, 50=0.56%, 100=4.10%, 250=93.44%, 500=1.59%
  lat (usec)   : 750=0.27%, 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=14.40%, sys=38.25%, ctx=10677663, majf=0, minf=225
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=10731076,4599270,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read-4K-qd128: (groupid=6, jobs=20): err= 0: pid=1691: Sun Jul 21 16:01:28 2019
   read: IOPS=379k, BW=1480MiB/s (1552MB/s)(43.3GiB/30001msec)
    slat (usec): min=2, max=4119, avg=42.77, stdev=117.04
    clat (usec): min=4, max=8839, avg=1639.22, stdev=468.66
     lat (usec): min=17, max=8853, avg=1683.30, stdev=474.00
    clat percentiles (usec):
     | 10.000th=[ 1074], 20.000th=[ 1237], 30.000th=[ 1369], 40.000th=[ 1483],
     | 50.000th=[ 1598], 70.000th=[ 1860], 90.000th=[ 2245], 99.000th=[ 2900],
     | 99.900th=[ 3490], 99.990th=[ 4948], 99.999th=[ 6587]
   bw (  KiB/s): min=43643, max=95697, per=4.45%, avg=67375.10, stdev=6133.13, samples=1180
   iops        : min=10910, max=23924, avg=16843.40, stdev=1533.28, samples=1180
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.12%, 750=1.20%, 1000=5.45%
  lat (msec)   : 2=72.31%, 4=20.89%, 10=0.03%
  cpu          : usr=11.01%, sys=73.38%, ctx=1922961, majf=0, minf=837
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=11363957,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-write-4K-qd128: (groupid=7, jobs=20): err= 0: pid=1711: Sun Jul 21 16:01:28 2019
  write: IOPS=425k, BW=1659MiB/s (1739MB/s)(48.6GiB/30002msec)
    slat (usec): min=2, max=2528, avg=38.11, stdev=91.25
    clat (usec): min=4, max=7970, avg=1462.20, stdev=416.63
     lat (usec): min=24, max=8323, avg=1501.47, stdev=421.44
    clat percentiles (usec):
     | 10.000th=[  955], 20.000th=[ 1106], 30.000th=[ 1221], 40.000th=[ 1319],
     | 50.000th=[ 1418], 70.000th=[ 1647], 90.000th=[ 2024], 99.000th=[ 2573],
     | 99.900th=[ 3064], 99.990th=[ 3556], 99.999th=[ 5014]
   bw (  KiB/s): min=46786, max=101815, per=4.14%, avg=70388.73, stdev=8141.17, samples=1180
   iops        : min=11696, max=25453, avg=17596.82, stdev=2035.30, samples=1180
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.06%, 750=2.29%, 1000=10.12%
  lat (msec)   : 2=76.90%, 4=10.62%, 10=0.01%
  cpu          : usr=12.54%, sys=74.91%, ctx=2144419, majf=0, minf=208
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,12738161,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
rand-rw-4K-qd128: (groupid=8, jobs=20): err= 0: pid=1745: Sun Jul 21 16:01:28 2019
   read: IOPS=232k, BW=906MiB/s (950MB/s)(26.5GiB/30001msec)
    slat (usec): min=2, max=6498, avg=48.67, stdev=143.29
    clat (usec): min=5, max=9682, avg=1874.62, stdev=525.23
     lat (usec): min=20, max=9763, avg=1924.80, stdev=530.03
    clat percentiles (usec):
     | 10.000th=[ 1221], 20.000th=[ 1418], 30.000th=[ 1565], 40.000th=[ 1713],
     | 50.000th=[ 1844], 70.000th=[ 2147], 90.000th=[ 2573], 99.000th=[ 3228],
     | 99.900th=[ 3851], 99.990th=[ 5145], 99.999th=[ 7308]
   bw (  KiB/s): min=29733, max=75712, per=5.03%, avg=46679.13, stdev=4806.06, samples=1183
   iops        : min= 7433, max=18928, avg=11669.52, stdev=1201.52, samples=1183
  write: IOPS=99.3k, BW=388MiB/s (407MB/s)(11.4GiB/30001msec)
    slat (usec): min=2, max=3630, avg=49.31, stdev=143.73
    clat (usec): min=4, max=9672, avg=1874.48, stdev=525.38
     lat (usec): min=28, max=9678, avg=1925.28, stdev=530.12
    clat percentiles (usec):
     | 10.000th=[ 1221], 20.000th=[ 1418], 30.000th=[ 1565], 40.000th=[ 1713],
     | 50.000th=[ 1844], 70.000th=[ 2147], 90.000th=[ 2573], 99.000th=[ 3228],
     | 99.900th=[ 3851], 99.990th=[ 5145], 99.999th=[ 7046]
   bw (  KiB/s): min=12879, max=31800, per=5.03%, avg=20000.69, stdev=2072.11, samples=1183
   iops        : min= 3219, max= 7950, avg=4999.91, stdev=518.04, samples=1183
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.10%, 750=0.57%, 1000=2.46%
  lat (msec)   : 2=58.18%, 4=38.62%, 10=0.06%
  cpu          : usr=10.10%, sys=71.70%, ctx=1698510, majf=0, minf=221
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=6955994,2980121,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=2440MiB/s (2559MB/s), 2440MiB/s-2440MiB/s (2559MB/s-2559MB/s), io=35.7GiB (38.4GB), run=15001-15001msec

Run status group 1 (all jobs):
   READ: bw=188MiB/s (197MB/s), 188MiB/s-188MiB/s (197MB/s-197MB/s), io=5634MiB (5908MB), run=30001-30001msec

Run status group 2 (all jobs):
  WRITE: bw=176MiB/s (184MB/s), 176MiB/s-176MiB/s (184MB/s-184MB/s), io=5267MiB (5523MB), run=30001-30001msec

Run status group 3 (all jobs):
   READ: bw=2106MiB/s (2209MB/s), 2106MiB/s-2106MiB/s (2209MB/s-2209MB/s), io=61.7GiB (66.3GB), run=30002-30002msec

Run status group 4 (all jobs):
  WRITE: bw=2038MiB/s (2137MB/s), 2038MiB/s-2038MiB/s (2137MB/s-2137MB/s), io=59.7GiB (64.1GB), run=30001-30001msec

Run status group 5 (all jobs):
   READ: bw=1397MiB/s (1465MB/s), 1397MiB/s-1397MiB/s (1465MB/s-1465MB/s), io=40.9GiB (43.0GB), run=30001-30001msec
  WRITE: bw=599MiB/s (628MB/s), 599MiB/s-599MiB/s (628MB/s-628MB/s), io=17.5GiB (18.8GB), run=30001-30001msec

Run status group 6 (all jobs):
   READ: bw=1480MiB/s (1552MB/s), 1480MiB/s-1480MiB/s (1552MB/s-1552MB/s), io=43.3GiB (46.5GB), run=30001-30001msec

Run status group 7 (all jobs):
  WRITE: bw=1659MiB/s (1739MB/s), 1659MiB/s-1659MiB/s (1739MB/s-1739MB/s), io=48.6GiB (52.2GB), run=30002-30002msec

Run status group 8 (all jobs):
   READ: bw=906MiB/s (950MB/s), 906MiB/s-906MiB/s (950MB/s-950MB/s), io=26.5GiB (28.5GB), run=30001-30001msec
  WRITE: bw=388MiB/s (407MB/s), 388MiB/s-388MiB/s (407MB/s-407MB/s), io=11.4GiB (12.2GB), run=30001-30001msec

Disk stats (read/write):
  sdb: ios=46653928/37606320, merge=0/0, ticks=6926048/4827428, in_queue=8780568, util=77.88%